Revit 2026 API

# SplitSketchBasedElementFailures Properties

---

The BuiltInFailuresSplitSketchBasedElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NotSplitValidRegions | The split failed. There may be a gap in the boundary loop or the sketch may be incomplete. |

#### Reference

BuiltInFailuresSplitSketchBasedElementFailures Class

Autodesk.Revit.DB Namespace